// ====================================================
// 文字列
// ====================================================

// ----------------------------------------------------

// ----------------------------------------------------
// 文字列"あいうえお"に含まれる"あ"を"お"に変換してください。
// ①課題通りにstrの文字列を変換し、新しい文字列を定数newStrとして定義してください。
// ②strとnewStrの値をログで出力し、値が変更されていることを確認する。

// ```
// var str = "あいうえお";
// ```

// ----------------------------------------------------
// forとpushをmapに変換;
// ----------------------------------------------------
// forやpushを使わずに加工した新しい配列を作ってください。
// ```
var nums = [1, 2, 3];
var array = [];
for (num of nums) {
  array.push(num * 2);
}
// ```
// ----------------------------------------------------
// forEachとpushをmapに変換;
// ----------------------------------------------------
// forEachやpushを使わずに加工した新しい配列を作ってください。
// ```
var nums = [1, 2, 3];
var array = [];
nums.forEach((num) => array.push(num + 1));
// ```

// ----------------------------------------------------
// map;
// ----------------------------------------------------
// 冗長な処理を排除してコーディングしてください。

// ```
var users = [
  {
    name: "Bob",
    age: 33,
  },
  {
    name: "Ren",
    age: 22,
  },
];
var names = users.map((user) => {
  return user.name;
});
// ```

// ----------------------------------------------------
// 非破壊的splice;
// ----------------------------------------------------
// spliceを使わず、非破壊的に配列の要素を削除してください。

// ```
var array = [1, 2, 3, 4];
var newArray = array.splice(0, 1);
// ```

// ----------------------------------------------------
// 非破壊的delete;
// ----------------------------------------------------
// deleteを使わず、非破壊的にオブジェクトの要素を削除してください。
// ```
var objcet = {
  name: "TaroYamada",
  age: 31,
  email: "taro@example.com",
};

// emailプロパティのみ削除してください
console.log(newObject); // { name: 'TaroYamada', age: 31 }
// ```

// ----------------------------------------------------
// let排除
// ----------------------------------------------------
// letを使わずにコーディングしてください。
// ```
var bool = true;
let val = "";
if (bool) {
  val = "trueです";
} else {
  val = "falseです";
}
// 上記の処理をletを使わずにコーディングしてください。
var newVal = "";
// ```

// ----------------------------------------------------
// ド・モルガンの法則2
// ----------------------------------------------------
// ド・モルガンの法則を使って条件式を簡易化してください。
var isString =
  value !== undefined || (value !== null && typeof value === "string");
